[{"reviewText":"Photo by Adri M.","url":"https://www.yelp.com/"},{"reviewText":"Best Pets Near London, London\n50a Earlham Street\nYou can request an appointment from this business\n16 Wigmore Street\n85 Camden Road\n32-34 Devonshire Road\n62 Sewardstone Road\n308 Portobello Road\n81 Chapel Market\n74 York Road\n220 Bethnal Green Road\n345 Caledonian Road","url":"https://www.yelp.co.uk/search?find_desc=Pets&find_loc=London"},{"reviewText":"226-228 Essex Road\nLondon N1 3AP","url":"https://www.yelp.co.uk/biz/canonbury-veterinary-practice-london?osq=vet"},{"reviewText":"Kenbury Street\nCamberwell\nLondon SE5 9BS","url":"https://www.yelp.co.uk/biz/the-london-animal-hospital-london?osq=vet"},{"reviewText":"82-86 Spa Rd\nBermondsey SE16 3QT","url":"https://www.yelp.co.uk/biz/the-london-cat-clinic-bermondsey?osq=vet"},{"reviewText":"86 York Street\nLondon W1H 1QS","url":"https://www.yelp.co.uk/biz/london-veterinary-clinic-london-2?osq=vet"},{"reviewText":"Royal College Street\nLondon NW1 0TU","url":"https://www.yelp.co.uk/biz/beaumont-animals-hospital-london?osq=vet"},{"reviewText":"151-153 Barking Road\nLondon E16 4HQ","url":"https://www.yelp.co.uk/biz/celia-hammond-animal-trust-london-2?osq=vet"},{"reviewText":"94 Dawes Road\nFulham\nLondon SW6 7EJ\n£10 off your first consultation","url":"https://www.yelp.co.uk/biz/paws-inc-veterinary-clinic-london?osq=vet"},{"reviewText":"Sonderburg Rd\nFinsbury Park\nLondon N7","url":"https://www.yelp.co.uk/biz/rspca-london-10?osq=vet"},{"reviewText":"85 Lavender Hill\nLondon SW11 5QL","url":"https://www.yelp.co.uk/biz/all-creatures-veterinary-surgery-london?osq=vet"},{"reviewText":"150 Corfield Street\nLondon\nLondon E2 0DS","url":"https://www.yelp.co.uk/biz/home-vets-london-london?osq=vet"},{"reviewText":"Photo by Taron G.","url":"https://www.yelp.com/"},{"reviewText":"Best Pets Near London, London\n50a Earlham Street\nYou can request an appointment from this business\n16 Wigmore Street\n85 Camden Road\n32-34 Devonshire Road\n62 Sewardstone Road\n308 Portobello Road\n81 Chapel Market\n74 York Road\n220 Bethnal Green Road\n345 Caledonian Road","url":"https://www.yelp.co.uk/search?find_desc=Pets&find_loc=London"},{"reviewText":"52 Amwell Street\nLondon EC1R 1XS\nStart your review of Amwell Veterinary Surgery\nSo far, so good... I found this veterinary practice on Yelp based on an older review, and hoped that all the facts still rung true. My luck (and Tillie's!) they certainly did. My pup is getting on in years, and that comes with its own set of challenges. I wanted to have her throughly checked out to make sure nothing was terribly amiss before we left on a long trip. I easily and quickly made an appointment with the very polite receptionist and was booked in for a Friday evening appointment. We arrived rain-soaked to a happy, warm office full of the vet's own pooches. We were greeted warmly, seen quickly and the good doctor gave her a once over and sent me home with instructions to collect a urine sample (I had my husband do that job, thankyouverymuch) and return the following day to have it tested for any irregularities, etc. Dutiful dog dad did just this, walked it back over, paid £20 for the test, and they called us later that day with the results: your dog is old and her kidneys are slow, but she isn't in any pain or distress. Well, all good...best case scenario and we now take many trips outside to use \"the loo\" to accommodate the kidney-deficient canine. Big plus: the initial exam and registration appointment is free of charge. I had no idea this was true...but what a great way to be introduced to a practice. I'll surely be back. Very friendly folks that won't try to upsell you and leave you bankrupt. Practical solutions for your pets.\nToday was Dexter's first visit to Amwell. The purpose of the visit was to get a refill of Loxicom and since we are new to the area and to the surgery, the vet wanted to check Dex out. No problemo.Our visit was free; all new patients are given a free consultation. So, that's awesome.Both the woman running \"front of house\" and the vet were super nice and smiley. I learned that the surgery is a one-man show which means the vet works a ton of hours! The surgery is super clean. Like super duper clean.His bedside manner was awesome. Dexter is generally not a huge fan of vet surgeries but he was more relaxed here than at any other vet surgery in the England. Perhaps this was because - since it is a one-man show - there were no other pets in the surgery waiting room, making him anxious. Perhaps it was because the examination room is twice the size of any examination room I've seen in England so he didn't feel boxed in. I don't know the reason. All I know is that Dexter was calm and wasn't trying to crawl under the table and that was nice.All of the above is great but the best thing about this surgery is the vet himself. Dex is an old chap. At 15.25, he's got his share of issues (arthritis, carpal hyperextension, poor eyesight, lumps, grumpiness) and our prior vet would always push us to do tests on his lumps or require that he do bloodwork to ensure Dexter's liver was handling his pain medications. I never agreed with this approach because Dexter is 15 years old. 15! There is no reason to run tests on his lumps because my husband and I have decided that we will take no action on said lumps. Why? Because he's 15. He is four years beyond the average max lifespan for his breed. This would be like giving a 100 year old human chemotherapy. I mean, that sounds a bit silly, right?Anyway, this vet shares our thoughts on tests and treatments and never once pressured me to run tests and that was the most wonderful thing ever. He respects our standpoint and since he never suggested running tests, I never felt guilty about being a bad human for not \"running every test imaginable to make sure my dog is absolutely taken care of and we know every single detail about his hemoglobin.\" I wish all vets were like this!\nBeen using amwell for a few months now, they have been very helpful, Dr dale have always been helpful for issues of my dog, Margaret is also very knowledgable about immigration and general health issues. I lived with my dog I three different countries, amwell is hands down the best vet I have been\nThe folks running the show here are incredibly professional and full of love for animals. They were so kind when helping us cope with the loss of a family pet and have been incredibly helpful now that we have a new set of kittens. We chose them because their office is close to our flat, but even if I lived in another part of London, I strongly consider keeping them as our vets.\nSuch a friendly veterinary surgery . The owner himself is welcoming and very caring. Takes his time and offers great advice.Would also recommend the puppy training classes they offer through their surgery","url":"https://www.yelp.co.uk/biz/amwell-veterinary-surgery-london?osq=vet"},{"reviewText":"52 Abbeville Road\nLondon SW4 9NF\nWith so few reviews, your opinion of David Cuffe & Associates could be huge. Start your review today.\nVery friendly and helpful staff!Would recommend this vet to anyone. Opening hours are very convenient - open to 7.30pm most evenings.Quite pricey though.\nVery happy with them, everyone in the area recommended them to me when I moved down. Not cheap but for a Vet open on Sundays Very pleased.","url":"https://www.yelp.co.uk/biz/david-cuffe-and-associates-london-3?osq=vet"},{"reviewText":"233-235 Lewisham Way\nLewisham\nLondon SE4 1UY","url":"https://www.yelp.co.uk/biz/celia-hammond-animal-trust-london?osq=vet"},{"reviewText":"7 Addison Avenue\nLondon W11 4QS","url":"https://www.yelp.co.uk/biz/the-holland-park-and-addison-veterinary-clinic-london?osq=vet"},{"reviewText":"Hyde Park Veterinary Centre\n61-63 Connaught Street\nLondon W2 2AE\nWith so few reviews, your opinion of Hyde Park Veterinary Centre could be huge. Start your review today.\nI've been here twice since my first review. Dr Andrew Prentis is amazing with our cat. It's the first time, I don't have to cling to her to keep her from bouncing all over the examination room. The other doctors, reception staff and the other staff are all amazing. Very professional and calmly reassuring in their manner.#YelpEveryDamnDayI've only been here to check the place out and register our cat, but I haven't taken her here yet.They have loads of veterinary specialists from neuro to small breeds (guinea pigs etc) and a tie-up for 24 hour accident and emergencyI got a very comforting feel with the few staff that I did interact with on my visit.There's a store next door which carries a decent variety of anything you may need for your dog / cat or some other pets\nLove love love this surgery. They have been looking after my dog for 12 years..I feel so well supported as he goes through his regular, age related episodes.  The nurses and vets are very thorough and seem to genuinly care, as does Lynn on reception! I have absolute faith in the vets I see there- Andrew, Odile and Matt, they are so kind, and even the locum vets I have seen there have been very, very professional.  On occasion I have been referred on for specialist care with Davies Animal Hospital specialists, either on site here or at the hospital in Hertfordshire. Communication between this surgery and the Davies's specialists is extremely good.  Out of hours care is taken at Elizabeth St Surgery, and again comms is good.  I cannot recommend this surgery highly enough.","url":"https://www.yelp.co.uk/biz/hyde-park-veterinary-centre-london?osq=vet"},{"reviewText":"55 Elizabeth Street\nVictoria\nLondon SW1W 9PP","url":"https://www.yelp.co.uk/biz/elizabeth-street-veterinary-clinic-and-emergency-service-london?osq=vet"},{"reviewText":"47 Burdett Road\nBow E3 4TN\nWith so few reviews, your opinion of Goddard Veterinary Group could be huge. Start your review today.\nI have to leave something here for Emily and her team at Goddard Vet Mile End, past and present. We have since left the area and leaving our wonderful vet behind was quite sad for us, and we took for granted the fantastic compassion, knowledge, honesty, and genuine care that they provided us with our three cats and two dogs.It seemed like we were never out of there sometimes as one cat developed what was swiftly diagnosed as pemphigus at just 6 months old, and one of our dogs was presenting with itchy skin; again, swiftly managed, and then diagnosed as an allergy to various dust mites. He was in remission after starting a course of immunotherapy.I cannot sing the Mile End team's praises enough; we had been with them since around 2011 but when Emily arrived it was noticeably different. She is quick to build a rapport, and always took the time to explain things to me and/or my other half and never dumbed it down or avoided answering questions, as unfortunately some vets do. Our pets were always treated with love and care, and expertly handled. Not once did I leave feeling like I had been fobbed off or given bad advice or treatment. The whole team were friendly, always lovely even when they were having a tough day, and always took the time to go the extra mile (end :P)I emailed them the other day as I had a reminder for one of our dogs' kennel cough vaccine, and sadly our other dog has since passed away so I wanted to let them know so we wouldn't get any reminders for our beloved pup. They sent a very touching and kind email back, and when my other half returned from London today I found that in our post was a card from them, offering sympathy for our lovely boy even though we no longer see them. We are so very touched by this and I want to sing their praises from the roof tops! It was only when we moved and registered with the vet closest to us that we realised how special Mile End actually are. We have since found a new super-vet further afield, but we still very much wish that 350 miles wasn't so far to go for a visit to Goddard!In short they are animal superheroes :)\nI have just taken one of my cats to the Mile End branch for the first time and I have to say how very impressed I was at the service and care from initial booking, consultation through to follow up plan.Having had cats all my life and moving around I have had [blessedly few but] enough experiences with vets to be able to judge.In the past, I have had average service for average fees, average service for rather high fees, exceptional service for more than average fees, not too long ago eye-watering fees for the most snooty, snotty uncaring poor service and today with Goddards at Mile End, I had truly delightful service that both my cat and I were very happy with for completely appropriate and affordable fees.Very happy to have found them. The surgery is small, clean, calm and welcoming. The staff are kind, caring and clearly very professional. Can not recommend the more highly.\nWe recently moved to the UK and needed a vet quickly in the area.  This place was close by and looked alright.  We've been to many vets across the US and while some were OK, I can say that with this recent visit that this is my favorite vet yet.It's a small building (all the shops along this road are small), but it's very clean and well kept.  The staff is also very welcoming and friendly.  In fact everyone appeared to not only want to get to know your animal, but the owners as well which is always important.Dr Emily Auger was wonderful with my pet.  She was very inquisitive and understanding when it came to everything, and you could tell she was not only a pet person, but also a people person (an important trait that many vets lack, you gotta deal constructively with the owners as well as the pets).  She instantly earned my trust with my cat.  I also noticed that after other pets left the exam room they still actively engaged with the animals.Dr Auger helped me with some estimates for recommended procedures in the future.  She expressed that her estimates weighed in on the worse case side (she gave me several different estimates/scenarios actually), so that if I chose to do the procedures I wouldn't likely be charged more than an estimate, and often be charged less. YES, this has always been a problem previously, finally a vet that doesn't tell me something cost 150 and charge me 200 at the end of the visit.  She also let me know that I wasn't a bad owner if I didn't get the procedure, that it wasn't absolutely necessary, just recommended.  Honest, upfront, and no pressure.The vet hours are also fantastic.  They're open till 7pm 4 of the 5 weekdays and 2pm-5pm every Saturday.  And for £37 per visit it's very reasonable for being in the city.  I'll certainly return frequently for all my pet needs from now on.\nWhen you become a dog/pet owner there are a minefield of decisions to make. Choosing a good vet is one of them. When googling, the Goddard group had a very comprehensive website, with great sections for different pets. It was easy to register online and my first puppy check was free. The vet and nurses are all lovely and very caring. Ham, my Border terrier, loves them all as he gets showered with attention and the odd treat when he's good. All jabs, microchipping, neutering etc have been done quickly and stress free for Ham and myself. Being a first time dog owner they have been a font of knowledge and very understanding.","url":"https://www.yelp.co.uk/biz/goddard-veterinary-group-bow-3?osq=vet"},{"reviewText":"85 Camden Road\nCamden\nLondon NW1 9EX","url":"https://www.yelp.co.uk/biz/pets-at-home-london-london-2?osq=vet"},{"reviewText":"71 St Helens Gardens\nLondon W10 6LL","url":"https://www.yelp.co.uk/biz/village-vet-london-33?osq=vet"},{"reviewText":"79 Grange Rd\nLondon SE1 3BW","url":"https://www.yelp.co.uk/biz/andrew-h-kirby-london?osq=vet"}]